app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT `carts`.* FROM `carts`

  def show
     begin
       @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = ? LIMIT 1  [["id", 1]]

  def destroy
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = ?  [["id", 2]]

    def set_cart
     # @cart = Cart.find(params[:id])

     begin
       @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = ? LIMIT 1  [["id", 2]]