app/controllers/line_items_controller.rb

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES (?, ?)  [["created_at", "2014-12-16 11:51:04"], ["updated_at", "2014-12-16 11:51:04"]]
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `updated_at`) VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", "2014-12-16 11:51:04"], ["product_id", 3], ["updated_at", "2014-12-16 11:51:04"]]
UPDATE `line_items` SET `quantity` = ?, `updated_at` = ? WHERE `line_items`.`id` = 4  [["quantity", 2], ["updated_at", "2014-12-17 04:55:49"]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
#    @line_item = @cart.line_items.build(:product => product)
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save