app/controllers/orders_controller.rb

  def index
    @orders = Order.page(params[:page]).order('created_at desc').per_page(10)
---
SELECT COUNT(*) FROM `orders`

  def new
    if current_cart.line_items.empty?
---
SELECT  1 AS one FROM `line_items`  WHERE `line_items`.`cart_id` = ? LIMIT 1  [["cart_id", 8]]
SELECT `line_items`.* FROM `line_items`  WHERE `line_items`.`cart_id` = ?  [["cart_id", 8]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
         Cart.destroy(session[:cart_id])
---
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM `carts` WHERE `carts`.`id` = ?  [["id", 8]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = ? LIMIT 1  [["id", 104]]