app/controllers/users_controller.rb

SELECT `users`.* FROM `users`   ORDER BY `users`.`name` ASC
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `name`, `updated_at`) VALUES (?, ?, ?)  [["created_at", "2014-12-18 01:19:49"], ["name", "Jerry"], ["updated_at", "2014-12-18 01:19:49"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

SELECT  `users`.* FROM `users`  WHERE `users`.`id` IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])